In [1]:
import pandas as pd

In [4]:
df=pd.read_csv("Bmi_male_female (1).csv")

In [5]:
df

     Gender  Height  Weight  Index
0      Male     174      96      4
1      Male     189      87      2
2    Female     185     110      4
3    Female     195     104      3
4      Male     149      61      3
..      ...     ...     ...    ...
495  Female     150     153      5
496  Female     184     121      4
497  Female     141     136      5
498    Male     150      95      5
499    Male     173     131      5

[500 rows x 4 columns]

In [19]:
y=df["Gender"]
x=df[["Height","Weight"]]

In [20]:
from sklearn.preprocessing import LabelEncoder

In [21]:
y

0        Male
1        Male
2      Female
3      Female
4        Male
        ...
495    Female
496    Female
497    Female
498      Male
499      Male
Name: Gender, Length: 500, dtype: object

In [ ]:
#label encoding is to convert string to numerical data

In [22]:
le=LabelEncoder()

In [24]:
Y=le.fit_transform(y)

In [25]:
from sklearn.model_selection import train_test_split

In [26]:
train_x,test_x,train_y,test_y=train_test_split(x,Y)

In [27]:
from sklearn.tree import DecisionTreeClassifier
model=DecisionTreeClassifier()

In [28]:
model.fit(train_x,train_y)

DecisionTreeClassifier()

In [31]:
model.score(test_x,test_y)*100

40.0

# one hot encoding

In [32]:
x

     Height  Weight
0       174      96
1       189      87
2       185     110
3       195     104
4       149      61
..      ...     ...
495     150     153
496     184     121
497     141     136
498     150      95
499     173     131

[500 rows x 2 columns]

In [36]:
y
y.head()

0      Male
1      Male
2    Female
3    Female
4      Male
Name: Gender, dtype: object

In [37]:
Y=pd.get_dummies(y)

In [38]:
Y

     Female  Male
0         0     1
1         0     1
2         1     0
3         1     0
4         0     1
..      ...   ...
495       1     0
496       1     0
497       1     0
498       0     1
499       0     1

[500 rows x 2 columns]

In [39]:
model.fit(x,Y)

DecisionTreeClassifier()

In [40]:
model.predict([[163,50]])

array([[1, 0]], dtype=uint8)

In [41]:
Y.head()

   Female  Male
0       0     1
1       0     1
2       1     0
3       1     0
4       0     1